SpenceKonde/ATTinyCore/avr/cores/tiny/Arduino.h
#ifndef Arduino_h
#define Arduino_h

#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <math.h>
#include "BasicMacros.h"

#include <avr/pgmspace.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>

#include "binary.h"

#ifdef __cplusplus
  extern "C"{
#endif

#ifndef ATTINYCORE
  #define ATTINYCORE "2.x.x+ unknown"
#endif


#define ADC_ERROR_NO_ADC          -32768
#define ADC_ERROR_DISABLED        -32767 /* ADC_ERROR_NO_ADC + 1 */
#define ADC_ERROR_BUSY            -32766 /* ADC_ERROR_NO_ADC + 2 */
#define ADC_ERROR_NOT_A_CHANNEL   -32765 /* ADC_ERROR_NO_ADC + 3 */
#define ADC_ERROR_SINGLE_END_IPR  -32764 /* ADC_ERROR_NO_ADC + 4 */

#ifndef USING_BOOTLOADER
  #define USING_BOOTLOADER 0
#endif


#if (F_CPU < 1000000L)
  //Prevent a divide by 0 is
  #warning "Clocks per microsecond < 1. To prevent divide by 0, it is rounded up to 1."
  #define clockCyclesPerMicrosecond() 1UL
#else
  #define clockCyclesPerMicrosecond() (F_CPU / 1000000UL)
#endif

#define ADC_CH(x) (0x80 | (x))

//#define clockCyclesToMicroseconds(a) (((a) * 1000L) / (F_CPU / 1000L))
//#define microsecondsToClockCycles(a) (((a) * (F_CPU / 1000L)) / 1000L)



typedef unsigned int word;


typedef uint8_t boolean;
typedef uint8_t byte;

void initToneTimer(void);
void init(void);

int main() __attribute__((weak));

void pinMode(uint8_t pinNumber, uint8_t mode);
void digitalWrite(uint8_t pinNumber, uint8_t val);
int8_t digitalRead(uint8_t pinNumber);
/* Copy of the ones on the modern AVR cores I maintain */
void openDrain(uint8_t pin, uint8_t mode);




int analogRead(uint8_t pinNumber);
#ifdef SLEEP_MODE_ADC
  int analogRead_NR(uint8_t pin);
  int _analogRead(uint8_t pin, bool use_noise_reduction);
#else
  int _analogRead(uint8_t pin);
#endif
void analogReference(uint8_t mode);
void analogWrite(uint8_t pinNumber, int16_t val);

void setADCDiffMode(bool bipolar);
void analogGain(uint8_t gain);

unsigned long millis(void);
unsigned long micros(void);

void yield(void);
void delay(unsigned long);

// Shamelessly stolen from @nerdralph's picoCore
// delays a specified number of microseconds
// works for clock frequencies of 1Mhz and up
__attribute((always_inline))
static inline void delayMicroseconds(uint16_t us)
{
    // if us is a compile-time constant result is accurate to 1 cycle
    if (__builtin_constant_p(us)) {
        _delay_us(us);
        return;
    }

    // when us is not known at compile time, delay is accurate to +/- 2us
    // plus an overhead of 3 CPU cycles
    const float fMHz = (F_CPU/1000000.0);
    // subtract two for rounding before dividing by 4
    us -= 2;
    delay4us:
        // delay 4us per loop, less 4 cycles for overhead
        _delay_us(4.0 - (4.0 / fMHz));
        asm volatile ("sbiw %[us], 4" : [us]"+d"(us));
    asm goto( "brpl %l[delay4us]" :::: delay4us);
}


unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout);
unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout);

void shiftOut(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder, uint8_t val);
uint8_t shiftIn(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder);

void attachInterrupt(uint8_t interrupt, void (*)(void), int mode);
void detachInterrupt(uint8_t interrupt);

void setup(void);
void loop(void);

// Compile-time error checking functions

void badArg(const char*) __attribute__((error("")));
// badArg is when we can determine at compile time that an argument is inappropriate.

void badCall(const char*) __attribute__((error("")));
// badCall is used when the function should not be called, period, under those conditions.

inline __attribute__((always_inline)) void check_constant_pin(uint8_t pin)
{
  if(!__builtin_constant_p(pin))
    badArg("Fast digital pin must be a constant");
}

// Get the bit location within the hardware port of the given virtual pin.
// This comes from the pins_*.c file for the active board configuration.

extern const uint8_t PROGMEM port_to_mode_PGM[];
extern const uint8_t PROGMEM port_to_input_PGM[];
extern const uint8_t PROGMEM port_to_output_PGM[];
#if defined PUEA
  extern const uint8_t PROGMEM port_to_pullup_PGM[];
#endif

extern const uint8_t PROGMEM digital_pin_to_port_PGM[];
extern const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[];
extern const uint8_t PROGMEM digital_pin_to_timer_PGM[];

// Get the bit location within the hardware port of the given virtual pin.
// This comes from the pins_*.c file for the active board configuration.
// These perform slightly better as macros compared to inline functions

#define const_array_or_pgm_(FUNC,ARR,IDX) ({size_t idx_ = (IDX); __builtin_constant_p((ARR)[idx_]) ? (ARR)[idx_] : FUNC((ARR)+idx_); })
#define digitalPinToPort(P)     (((P) < NUM_DIGITAL_PINS) ? const_array_or_pgm_(pgm_read_byte, digital_pin_to_port_PGM, (P)) : NOT_A_PORT)
#define digitalPinToBitMask(P)  (((P) < NUM_DIGITAL_PINS) ? const_array_or_pgm_(pgm_read_byte, digital_pin_to_bit_mask_PGM, (P)) : NOT_A_PIN)
#define digitalPinToTimer(P)    (const_array_or_pgm_(pgm_read_byte, digital_pin_to_timer_PGM, (P)))
#define analogInPinToBit(P)     (P)
#define portOutputRegister(P)   ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_output_PGM, (P))))
#define portInputRegister(P)    ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_input_PGM, (P))))
#define portModeRegister(P)     ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_mode_PGM, (P))))
#if defined(PUEA)
  #define portPullupRegister(P) ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_pullup_PGM, (P))))
#endif

#define NOT_A_PIN     255
#define NOT_A_TIMER   255 /* Not the same as NOT_ON_TIMER */
#define NOT_A_PORT    0   /* Different from modern AVR!   */
#define NOT_A_CHANNEL 127

#define PA 1
#define PB 2
#define PC 3
#define PD 4

#define NOT_ON_TIMER 0
#define TIMER0A 1
#define TIMER0B 2
#define TIMER1A 3
#define TIMER1B 4
#define TIMER2A 5
#define TIMER2B 6
#define TIMER1D 7

/* This is TRICKY
  We need the bitmask, not bit position when we use this.
  The analogWrite() function is going to need to know the
  timer + channel AND the TOCC bitmask, with the minimum
  possible effort. In this case, the byte breaks down as:

