SpenceKonde/ATTinyCore/avr/cores/tiny/Arduino.h
  0b tttt s ccc

  Where:
  c is the timer channel (see above defines)
  t is (1 << (TOCCnumber & 0x03)) - that is 0b0001, 0b0010, 0b0100, or 0b1000
  s is 0 if TOCCnumber < 4, otherwise 1
  The left/rightshift 4 positions is only 2 clocks - 1 for a swp instruction
  1 for andi 0xF0/0x0F (depending on direction of shift), whild 4 actual left/ri

  So timer number = TOCCn & 0x07, and
  TOCC mask = TOCCn & 0xF0 >> (TOCCn & 0x08)?4:0
*/
#if defined(TOCPMCOE)
  #define TOCC0  (0x10)
  #define TOCC1  (0x20)
  #define TOCC2  (0x40)
  #define TOCC3  (0x80)
  #define TOCC4  (0x18)
  #define TOCC5  (0x28)
  #define TOCC6  (0x48)
  #define TOCC7  (0x88)
#endif

/*  Timer1 on the ATtiny167/ATtiny87 can output an
  identical waveform on one or more of 4 pins per
  channel. Implementing this was faster than making
  an actual "decision" */
#if defined(OC1AX)
  #define TIM1AU (0x18 | 3)
  #define TIM1AV (0x28 | 3)
  #define TIM1AW (0x48 | 3)
  #define TIM1AX (0x88 | 3)
  #define TIM1BU (0x14 | 4)
  #define TIM1BV (0x24 | 4)
  #define TIM1BW (0x44 | 4)
  #define TIM1BX (0x84 | 4)
#endif
#include "pins_arduino.h"

// 99% of parts have the whole USI on one port. 1634 doesn't! Here, if pins_arduino.h has
// defined a separate clock DDR, we leave it, otherwise point these defines at same port as
// the data lines. We also use the pin definitions to generate SPI and TWI pin mappings.

#ifndef USI_CLOCK_DDR
  #define USI_CLOCK_DDR   USI_DDR
  #define USI_CLOCK_PORT  USI_PORT
  #define USI_CLOCK_PIN   USI_PIN
#endif
#if defined(USI_PUE) && !defined(USI_CLOCK_PUE)
  #define USI_CLOCK_PUE   USI_PUE
#endif

// If these are defined by pins_arduino, then it's not a USI-based part

#ifndef SCK
  #define MOSI  USI_DO
  #define MISO  USI_DI
  #define SCK   USI_SCK
#endif

#ifndef SCL
  #define SDA   USI_DI
  #define SCL   USI_SCK
#endif


/*=============================================================================
 * From what we got in pins_arduino.h as well as defines passed to the compiler from board submenu
 * options, determine which features to enable.
=============================================================================*/

#ifndef USE_SOFTWARE_SERIAL
  // Don't use builtin software serial unless the variant asked for it because there wasn't a hardware one.
  #define USE_SOFTWARE_SERIAL                       0
#endif

/* As of ATTinyCore 2.0.0, we have abandoned the pretense of the variant being
 * able to choose whichever timer it wants for millis. I'm not sure how far back
 * one would need to go to find a version of ATTinyCore where that worked
 * but I am damned sure it doesn't work correctly now. So we will no longer
 * include a TIMER_TO_USE_FOR_MILLIS option that might as well be named
 * SET_THIS_TO_0_OR_NOTHING_WORKS.
 *---------------------------------------------------------------------------*/

#ifndef TIMER_TO_USE_FOR_MILLIS
  #define TIMER_TO_USE_FOR_MILLIS                   0
#endif

#if defined(DISABLE_MILLIS)
  #define MILLIS_USE_TIMERNONE
  // forwards compatibility
#else
  // So you can test #ifdef millis
  #define millis millis
  #define micros micros
#endif

#if TIMER_TO_USE_FOR_MILLIS != 0
  #if !defined(DISABLE_MILLIS)
    #warning "Millis not disabled, and set to use a non-standard timer. This code has not been exercised since at least 2016!"
  #else
    #warning "Non-standard timer arrangement selected. This code has not been exercised since at least 2016!"
  #endif
#endif

#if NUM_ANALOG_INPUTS > 0
  #ifndef ADCSRA
    #error "STOP - NUM_ANALOG_INPUTS is not 0, but no ADC present on chip. This indicates a critical defect in ATTinyCore which should be reported promptly."
  #endif
  #define HAVE_ADC                                  1
  #ifndef INITIALIZE_ADC
    #ifndef DEFAULT_INITIALIZE_ADC
      #define INITIALIZE_ADC                        1
    #else
      #define INITIALIZE_ADC                        DEFAULT_INITIALIZE_ADC
    #endif
  #endif
#else
  #if defined(INITIALIZE_ADC)
    #if INITIALIZE_ADC != 0
      #error "STOP - Variant requested that the ADC be initialized, but this part does not have one (NUM_ANALOG_INPUTS == 0). This indicates a critical defect in ATTinyCore which should be reported promptly."
    #endif
    #undef INITIALIZE_ADC
  #endif
  #define INITIALIZE_ADC                            0
#endif

#ifndef INITIALIZE_SECONDARY_TIMERS
  #ifdef DEFAULT_INITIALIZE_SECONDARY_TIMERS
    #define INITIALIZE_SECONDARY_TIMERS             DEFAULT_INITIALIZE_SECONDARY_TIMERS
  #else
    #define INITIALIZE_SECONDARY_TIMERS             1
  #endif
#endif

#ifndef TIMER_TO_USE_FOR_TONE
  #if TIMER_TO_USE_FOR_MILLIS == 0
    #define TIMER_TO_USE_FOR_TONE                   1
  #else
    #define TIMER_TO_USE_FOR_TONE                   0
  #endif
#else
  #if TIMER_TO_USE_FOR_TONE == TIMER_TO_USE_FOR_MILLIS && !defined(DISABLE_MILLIS)
    #error "Tone and millis are set to use the same timer. This is unsupported. If you did not modify the core files, this is defect in ATTinyCore and should be reported promptly."
  #endif
#endif


inline __attribute__((always_inline)) uint8_t check_valid_digital_pin(uint8_t pin) {
  if(__builtin_constant_p(pin)) {
    if (pin >= NUM_DIGITAL_PINS && pin != NOT_A_PIN)
    // Exception made for NOT_A_PIN - code exists which relies on being able to pass this and have nothing happen.
    // While IMO very poor coding practice, these checks aren't here to prevent lazy programmers from intentionally
    // taking shortcuts we disapprove of, but to call out things that are virtually guaranteed to be a bug.
    // Passing -1/255/NOT_A_PIN to the digital I/O functions is most likely intentional.
      badArg("Digital pin is constant, but not a valid pin");
    return pin != NOT_A_PIN;
  }
  return 1;
}
inline __attribute__((always_inline)) void pinModeFast(uint8_t pin, uint8_t mode) {
  check_constant_pin(pin);
  if (!check_valid_digital_pin(pin)) {
    badArg("Fast I/O functions must be called with a valid pin number.");
  }
  if (!__builtin_constant_p(mode))
    badArg("openDrainFast requires the mode to be compile time known");
  if (pin > 127) {
    pin = analogInputToDigitalPin((pin & 127));
  }
  uint8_t mask = digitalPinToBitMask(pin);
  uint8_t port = digitalPinToPort(pin);
  if (port == NOT_A_PIN) return;
  volatile uint8_t *reg, *out;
  reg = portModeRegister(port);
  #if defined(PUEA)
    out = portPullupRegister(port);
  #else
    out = portOutputRegister(port);
  #endif
  if (mode == INPUT) {
    uint8_t oldSREG = SREG;
    cli();
    *reg &= ~mask;
    *out &= ~mask;
    SREG = oldSREG;
  } else if (mode == INPUT_PULLUP) {
    uint8_t oldSREG = SREG;
    cli();
    *reg &= ~mask;
    *out |= mask;
    SREG = oldSREG;
  } else {
    uint8_t oldSREG = SREG;
    cli();
    *reg |= mask;
    SREG = oldSREG;
  }
}
inline __attribute__((always_inline)) void openDrainFast(uint8_t pin, uint8_t mode) {
  check_constant_pin(pin);
  if (!check_valid_digital_pin(pin)) {
    badArg("Fast I/O functions must be called with a valid pin number.");
  }
  if (!__builtin_constant_p(mode))
    badArg("openDrainFast requires the mode to be compile time known");
  if (pin > 127) {
    pin = analogInputToDigitalPin((pin & 127));
  }
  uint8_t mask = digitalPinToBitMask(pin);
  uint8_t port = digitalPinToPort(pin);
  if (port == NOT_A_PIN) return;

