SpenceKonde/ATTinyCore/avr/cores/tiny/Arduino.h
  volatile uint8_t *ddr, *out;
  ddr = portModeRegister(port);
  out = portOutputRegister(port);
  if (mode == FLOATING) {
    *out &= ~mask;
    *ddr &= ~mask;
  } else if (mode == LOW) {
    *out &= ~mask;
    *ddr |= mask;
  }
}
inline __attribute__((always_inline)) int8_t digitalReadFast(uint8_t pin) {
  check_constant_pin(pin);
  if (pin > 127) {
    pin = analogInputToDigitalPin((pin & 127));
  }
  check_valid_digital_pin(pin);

  uint8_t mask = digitalPinToBitMask(pin);
  uint8_t port = digitalPinToPort(pin);
  //if (port == NOT_A_PORT) return NOT_A_PIN;  // This check is not needed, as we reject non-constant pins but constant pins that are never valid get rejected by check valid digital pin!
  return !!(*portInputRegister(port) & mask);
}

#if defined(__AVR_ATtinyX41__)
  inline __attribute__((always_inline)) void digitalWriteFaster(uint8_t pin, uint8_t val) {
    // "Pullup enable? Never heard if it"
    // writes the output register without touching the PUE register. Avail. on 841 and 441 only because that's the only place that the
    // pullup register is not in the low I/O space and is thus painfully slow to acess.
    check_constant_pin(pin);
    if (pin > 127) {
      pin = analogInputToDigitalPin((pin & 127));
    }
    if (!check_valid_digital_pin(pin)) {
      // check_valid_digital_pin returns 0 if the pin is explicitly NOT_A_PIN, 1 if it is a pin, and errors with badArg if it's not a pin.
      return;
    }
    uint8_t mask = digitalPinToBitMask(pin);
    uint8_t port = digitalPinToPort(pin);
    volatile uint8_t *out;
    if (port == NOT_A_PIN) return;
    out = portOutputRegister(port);
    if (val == LOW) {                  // 2 instruction
      *out &= ~mask;                   // 1/1 atomic
    } else {                           //
      *out |= mask;                    // 1/1
    }
  }
#endif

inline __attribute__((always_inline)) void digitalWriteFast(uint8_t pin, uint8_t val) {
  check_constant_pin(pin);
  if (pin > 127) {
    pin = analogInputToDigitalPin((pin & 127));
  }
  if (!check_valid_digital_pin(pin)) {
    // check_valid_digital_pin returns 0 if the pin is explicitly NOT_A_PIN, 1 if it is a pin, and errors with badArg if it's not a pin.
    return;
  }
  uint8_t mask = digitalPinToBitMask(pin);
  uint8_t port = digitalPinToPort(pin);
  volatile uint8_t *out;
  if (port == NOT_A_PIN) return;
  out = portOutputRegister(port);
  #if defined(__AVR_ATtinyX41__)      //Uniquely bad
    volatile uint8_t *pue, *mode;     //
    pue = portPullupRegister(port);   //
    mode = out + 1;
    if (val == LOW) {                 // 2 instructions

      if (*mode & mask) {
        *out &= ~mask;                // 1/1 atomic
      } else {                        // 1/1 +1
        uint8_t oldSREG = SREG;       // 1/1
        cli();                        // 1/1
        *pue &= ~mask;                // 3/5 in 5
        SREG = oldSREG;               // 1/1
      }
    } else {                          // total subtotal 8/10 in 5/9
      if (*mode & mask) {             // 1/1
        *out &= ~mask;                // 1/1
      } else {                        // 1/1 in 2
        uint8_t oldSREG = SREG;       // 1/1
        cli();                        // 1/1
        *pue &= ~mask;                // 3/5 in 5
        SREG = oldSREG;               // 1/1
      }                               // 17 instruction, 21 word, and and execution time of 8-12 clocks?
                                      // A whole new definition of fast (now it means "slow") - who wants to inline that!?
    }
  #elif defined(PUEA)
    volatile uint8_t *pue;
    pue = portPullupRegister(port);   //

    if (val == LOW) {
      *pue &= ~mask;                  // 1/1
      *out &= ~mask;                  // 1/1
    } else {                          // 1/1
      *pue &= ~mask;                  // 1/1
      *out &= ~mask;                  // 1/1
    }
      // constant pin -> constant out register.
      // constant val -> constant mask. Combined with above means we will get CBI/SBI (only one bit at a time will be set in the mask
  #else                               // total 13 and 13 and execution time of ~8 eitherway
    if (val == LOW) {
      *out &= ~mask;                  // 1/1
    } else {                          // 1/1
      *out &= ~mask;                  // 1/1
    }   // and we know which one at compile time, so
  #endif
}




#ifdef __cplusplus
  } // extern "C"
#endif

#ifdef __cplusplus
  #include "WCharacter.h"
  #include "WString.h"
  #include "HardwareSerial.h"
  #include "TinySoftwareSerial.h"

  uint16_t makeWord(uint16_t w);
  uint16_t makeWord(byte h, byte l);

  #define word(...) makeWord(__VA_ARGS__)
  unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);
  unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);

  void tone(uint8_t _pin, unsigned long frequency, unsigned long duration = 0);
  void noTone(uint8_t _pin = 255);

  // WMath prototypes
  long random(long);
  long random(long, long);
  void randomSeed(unsigned int);
  long map(long, long, long, long, long);

#endif

/* SIGRD is missing from some of the IO headers, where it should
 * be defined as 5 for most parts. It is sometimes omitted entirely
 * and sometimes named RSIG. It is not present at all for some parts
 * and it's unknown at this time whether that feature didn't exist
 * and there was literally no way for the part to read it's own signature
 * or if they just couldn't be bothered to document it. Because it is often
 * missing from the headers for parts that do have it, we define it everywhere.

These call it SIGRD:
ATtiny167, ATtiny87

These call it RSIG:
ATtiny1634, ATtiny24*, ATtiny25, ATtiny4313, ATtiny44*, ATtiny441, ATtiny45, ATtiny828, ATtiny84*, ATtiny841, ATtiny85

* datasheet doesn't mention it, and in fact lists just 5 valid combinations of of SPMCSR bits, that will have any effect
...

These don't list it, but the datasheet says they support it:
ATtiny43U, ATtiny24A, ATtiny44A, ATtiny84A

These don't list it in either place:
ATtiny48, ATtiny88, All x61 family

It really makes one wonder about the documentation folks (and this section is all copypasta). There's only one way to get the answer:

#define SECTION_FUSE_LOCK 0x09
#define SECTION_SIGROW 0x21

uint8_t readSpecialSection(uint16_t addr, uint8_t section) { /
  if((section == 0x21 || section == 0x09))
  uint8_t result = (1 << section) | 1;
  __asm__ __volatile__ (
    "sts %[spmcsr], %[result]"  "\n\t"
    "lpm %[result], Z"          "\n\t"
  : [result] "+r" (result)
  : [spmcsr] "i" (_SFR_MEM_ADDR(__SPM_REG)),
    "z" (addr)
  );
  return result;
}

void setup() {
  Serial.begin(9600);
  for (uint16 i; i < 16; i++) {
    uint8_t result = readSpecialSection(i, SECTION_FUSE_LOCK)
    Serial.printHex(result);
  }
  for (uint16 i; i < 16; i++) {
    uint8_t result = readSpecialSection(i, SECTION_FUSE_LOCK)
    Serial.printHex(result);
  }
}
void loop() {
  ;
}


 * so it's unfortunate that they did named it so inconsistently.   */
#ifndef SIGRD
  #ifndef RSIG
    #define SIGRD 5
    #define RSIG 5
  #else
    #define SIGRD RSIG
  #endif
#else
  #ifndef RSIG
    #define RSIG SIGRD
  #endif
#endif

