SpenceKonde/ATTinyCore/avr/cores/tiny/Arduino.h
/*---------------------------------------------------------------------------
 * Aliases for the interrupt service routine vector numbers so the code
 * (core and app) doesn't have to be riddled with quite as many ifdefs
 * Why couldn't they have picked one naming convention and stuck to it?
 * TIMn or TIMERn - they're both perfectly fine naming conventions...
 * And it would also have been okay if the decision of which to use was based
 * on whether it was a normal timer or a funky one (like the high speed timers)
 * But as far as I can tell, it was based on release date or coin flip.
 * For minimum pain to users, we go both directions.
 *---------------------------------------------------------------------------*/

// On the 26, there's an extra number on the vectors, get rid of it.
#if defined(TIMER1_OVF1_vect)
  #define TIMER1_OVF_vect_num TIMER1_OVF1_vect_num
  #define TIMER1_OVF_vect TIMER1_OVF1_vect
  #define TIMER0_OVF_vect_num TIMER0_OVF0_vect_num
  #define TIMER0_OVF_vect TIMER0_OVF0_vect
#endif

#if defined(TIM0_CAPT_vect)   && !defined(TIMER0_CAPT_vect)
  #define TIMER0_CAPT_vect TIM0_CAPT_vect
#endif
#if defined(TIM0_COMPA_vect)  && !defined(TIMER0_COMPA_vect)
  #define TIMER0_COMPA_vect TIM0_COMPA_vect
#endif
#if defined(TIM0_COMPB_vect)  && !defined(TIMER0_COMPB_vect)
  #define TIMER0_COMPB_vect TIM0_COMPB_vect
#endif
#if defined(TIM0_OVF_vect)    && !defined(TIMER0_OVF_vect)
  #define TIMER0_OVF_vect TIM0_OVF_vect
#endif
#if defined(TIM1_CAPT_vect)   && !defined(TIMER1_CAPT_vect)
  #define TIMER1_CAPT_vect TIM1_CAPT_vect
#endif
#if defined(TIM1_COMPA_vect)    && !defined(TIMER1_COMPA_vect)
  #define TIMER1_COMPA_vect TIM1_COMPA_vect
#endif
#if defined(TIM1_COMPB_vect)    && !defined(TIMER1_COMPB_vect)
  #define TIMER1_COMPB_vect TIM1_COMPB_vect
#endif
#if defined(TIM1_OVF_vect)      && !defined(TIMER1_OVF_vect)
  #define TIMER1_OVF_vect TIM1_OVF_vect
#endif
#if defined(TIM2_CAPT_vect)     && !defined(TIMER2_CAPT_vect)
  #define TIMER2_CAPT_vect TIM2_CAPT_vect
#endif
#if defined(TIM2_COMPA_vect)    && !defined(TIMER2_COMPA_vect)
  #define TIMER2_COMPA_vect TIM2_COMPA_vect
#endif
#if defined(TIM2_COMPB_vect)    && !defined(TIMER2_COMPB_vect)
  #define TIMER2_COMPB_vect TIM2_COMPB_vect
#endif
#if defined(TIM2_OVF_vect)      && !defined(TIMER2_OVF_vect)
  #define TIMER2_OVF_vect TIM2_OVF_vect
#endif

// Now the other direction...
#if defined(TIMER0_CAPT_vect)   && !defined(TIM0_CAPT_vect)
  #define TIM0_CAPT_vect TIMER0_CAPT_vect
#endif
#if defined(TIMER0_COMPA_vect)  && !defined(TIM0_COMPA_vect)
  #define TIM0_COMPA_vect TIMER0_COMPA_vect
#endif
#if defined(TIMER0_COMPB_vect)  && !defined(TIM0_COMPB_vect)
  #define TIM0_COMPB_vect TIMER0_COMPB_vect
#endif
#if defined(TIMER0_OVF_vect)    && !defined(TIM0_OVF_vect)
  #define TIM0_OVF_vect TIMER0_OVF_vect
#endif
#if defined(TIMER1_CAPT_vect)   && !defined(TIM1_CAPT_vect)
  #define TIM1_CAPT_vect TIMER1_CAPT_vect
#endif
#if defined(TIMER1_COMPA_vect)  && !defined(TIM1_COMPA_vect)
  #define TIM1_COMPA_vect TIMER1_COMPA_vect
#endif
#if defined(TIMER1_COMPB_vect)  && !defined(TIM1_COMPB_vect)
  #define TIM1_COMPB_vect TIMER1_COMPB_vect
#endif
#if defined(TIMER1_OVF_vect)    && !defined(TIM1_OVF_vect)
  #define TIM1_OVF_vect TIMER1_OVF_vect
#endif
#if defined(TIMER2_CAPT_vect)   && !defined(TIM2_CAPT_vect)
  #define TIM2_CAPT_vect TIMER2_CAPT_vect
#endif
#if defined(TIMER2_COMPA_vect)  && !defined(TIM2_COMPA_vect)
  #define TIM2_COMPA_vect TIMER2_COMPA_vect
#endif
#if defined(TIMER2_COMPB_vect)  && !defined(TIM2_COMPB_vect)
  #define TIM2_COMPB_vect TIMER2_COMPB_vect
#endif
#if defined(TIMER2_OVF_vect)    && !defined(TIM2_OVF_vect)
  #define TIM2_OVF_vect TIMER2_OVF_vect
#endif
#endif
